# Pandas

In [3]:
import pandas as pd

In [7]:
#como criar um indice

serie = pd.Series(
    ["Brasil", "França", "Austrália"],
    index = ["América_do_sul", "Europa", "Oceania"])

print(serie.index)
serie.index[1]

Index(['América_do_sul', 'Europa', 'Oceania'], dtype='object')

'Europa'

In [19]:
#como colocar uma coluna como índice

dicionario = {
    "empresa": ['Weg', 'Petro', 'Vale'],
    "cotacao": [20.54, 20, 40]
}

df = pd.DataFrame(dicionario)
#Index é criado por que valores do dicinário estao em listas

df

  empresa  cotacao
0     Weg    20.54
1   Petro    20.00
2    Vale    40.00

In [20]:
#definindo uma coluna como index
df = df.set_index("empresa")
df

         cotacao
empresa
Weg        20.54
Petro      20.00
Vale       40.00

In [21]:
df = df.reset_index()
#retornando index para 0,1,2,...
print(df)

df.index = ['a', "b", "c"]
df

  empresa  cotacao
0     Weg    20.54
1   Petro    20.00
2    Vale    40.00

  empresa  cotacao
a     Weg    20.54
b   Petro    20.00
c    Vale    40.00

In [24]:
#criar um range de data como um indice

#4 dias sequenciais
quatro_dias = pd.date_range('1/4/2000', periods= 4)
print(quatro_dias)

#ultimos dias dos meses
fim_mes = pd.date_range(start= '1/1/2000', end= '31/12/2000', freq = 'M')
fim_mes

DatetimeIndex(['2000-01-04', '2000-01-05', '2000-01-06', '2000-01-07'], dtype='datetime64[ns]', freq='D')

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31', '2000-06-30', '2000-07-31', '2000-08-31',
               '2000-09-30', '2000-10-31', '2000-11-30', '2000-12-31'],
              dtype='datetime64[ns]', freq='M')

In [27]:
fim_mes_weg = pd.date_range(start= '1/1/2000', end = '30/4/2000', freq = "M")
print(fim_mes_weg)

dicionario = {'cotacao': [20, 20, 21.1, 22]}

cotacao_weg = pd.DataFrame(dicionario, index = fim_mes_weg)

cotacao_weg

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30'], dtype='datetime64[ns]', freq='M')

            cotacao
2000-01-31     20.0
2000-02-29     20.0
2000-03-31     21.1
2000-04-30     22.0

In [1]:
cotacao_weg[cotacao_weg.index > '2000-02-25']

NameError: name 'cotacao_weg' is not defined

### Desafios

In [4]:

datas = pd.date_range('10/10/2023',  periods= 5)

dicionario = {
    "volume": [1000, 2000, 2500, 7000, 5000],
    "cotacao": [20.54, 20, 40, 30, 31.50],
    "datas": datas
}

df = pd.DataFrame(dicionario)
df

   volume  cotacao      datas
0    1000    20.54 2023-10-10
1    2000    20.00 2023-10-11
2    2500    40.00 2023-10-12
3    7000    30.00 2023-10-13
4    5000    31.50 2023-10-14

In [5]:
df =df.set_index("datas")
df

            volume  cotacao
datas
2023-10-10    1000    20.54
2023-10-11    2000    20.00
2023-10-12    2500    40.00
2023-10-13    7000    30.00
2023-10-14    5000    31.50

In [9]:
#exercicio 36
dict_desafio = {
    "tickers" : ["WEGE3", "PETR3", "VALE3", "PETR4", "LREN3"],
    "cotacoes": [20, 30, 40, 12, 35],
    "nomes": ['Weg', 'Petro', 'Vale', 'Petro', 'Lojas Renner'],
    "preco_sobre_lucro": [25, 6, 12, 7, 25],
    "volume": [5000, 1000, 4000, 7000, 1200]
    }

dataframe_desafio = pd.DataFrame(dict_desafio, index= [1, 2, 3, 4, 5])
dataframe_desafio

  tickers  cotacoes         nomes  preco_sobre_lucro  volume
1   WEGE3        20           Weg                 25    5000
2   PETR3        30         Petro                  6    1000
3   VALE3        40          Vale                 12    4000
4   PETR4        12         Petro                  7    7000
5   LREN3        35  Lojas Renner                 25    1200

In [ ]:
dataframe_desafio = dataframe_desafio.set_index("tickers")

In [12]:
dataframe_desafio

         cotacoes         nomes  preco_sobre_lucro  volume
tickers
WEGE3          20           Weg                 25    5000
PETR3          30         Petro                  6    1000
VALE3          40          Vale                 12    4000
PETR4          12         Petro                  7    7000
LREN3          35  Lojas Renner                 25    1200